---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetEndConstraint
source: html/bfa1ffbd-d5fa-835b-d628-a9ed97e90017.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetEndConstraint Method

Gets the current constraint for the end handle of the Rebar.

## Syntax (C#)
```csharp
public RebarConstraint GetEndConstraint()
```

## Returns
Returns the current constraint for the end handle of the Rebar. Return value is null is no constraint is present.